src/main/resources/car-search-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCarSearchRequest>
            <gs:criteria>marka</gs:criteria>
            <gs:searchKey>Audi</gs:searchKey>
        </gs:getCarSearchRequest>
    </soapenv:Body>
</soapenv:Envelope>